System.register("chunks:///_virtual/StarsTowerConfig.ts", ["cc"], (function(S) {
        var R;
        return {
            setters: [function(S) {
                R = S.cclegacy
            }
            ],
            execute: function() {
                R._RF.push({}, "ab095MOP9xCiaqsruChc1kP", "StarsTowerConfig", void 0);
                S("CLIP_ARR", {
                    0: "草之珠儿",
                    1: "普之舜舜",
                    2: "机之喵宝儿",
                    3: "小小璨雪",
                    4: "小小丹青",
                    5: "小小飞儿",
                    6: "大雪",
                    7: "清明",
                    8: "秋分",
                    9: "小暑",
                    10: "霜降",
                    11: "谷雨",
                    12: "公瑾",
                    13: "奉先",
                    14: "洛神",
                    15: "玄德",
                    16: "子龙",
                    17: "貂蝉",
                    18: "星耀独角兽",
                    19: "东圣兽青龙",
                    20: "圣域白泽",
                    21: "圣域灵犬",
                    22: "王者路路",
                    23: "王者独角兽",
                    24: "纳舜诺德",
                    25: "万圣",
                    26: "感恩",
                    27: "圣诞",
                    28: "元宵",
                    29: "圣瓦伦丁",
                    30: "泰西斯",
                    31: "塔那托斯",
                    32: "塔罗斯",
                    33: "伏尔坎",
                    34: "提亚",
                    35: "赫拉",
                    36: "文采呱呱",
                    37: "伯爵迦尔纳",
                    38: "噬魂战龙王",
                    39: "灵息帕尔",
                    40: "羽泽",
                    41: "翊尘剑圣"
                }),
                    S("FLOOR_INDEX_ARR", {
                        0: "一",
                        1: "二",
                        2: "三",
                        3: "四",
                        4: "五",
                        5: "六",
                        6: "七",
                        7: "八"
                    }),
                    S("STARS_CONDITION", {
                        0: "战斗胜利",
                        1: "携带宠物不超过4只",
                        2: "携带宠物不超过2只"
                    }),
                    S("UPBOSS_MAX_STAR", 30),
                    S("UPBOSS_STAR_CONDITION", [3, 6, 9, 12, 15, 30]),
                    S("UPBOSS_STAR_PROGRESS", [.15, .28, .42, .55, .7, 1]),
                    S("PETARR", [[2286, 2297, 2300, 2593, 2467, 2466], [2342, 2334, 2512, 2337, 2493, 2423], [2275, 2278, 2234, 2236, 2269, 2277], [2348, 2369, 2442, 2494, 2218, 2349], [2533, 2539, 2548, 2551, 2602, 2603], [2395, 2390, 2510, 2497, 2393, 2445], [2433, 2483, 2328, 2528, 2526, 2488]]),
                    S("LOTTERY_PROPS", [17170485, 67239984, 67371909, 67371891, 17170484, 17367044, 67371891, 16842774, 100859909, 67371891]),
                    S("TOP_BOSS_REWARD_TIPS", ["分配经验*600万", "6种努力果*60", "分配经验*900万", "礼遇契约*5", "一键满级", "洛克钻*30"]);
                R._RF.pop()
            }
        }
    }
));
